docs/benchmark/results-wrk2-c1000/raw/nginx-R50000-r3.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.668ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.680ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.667ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.680ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.65ms    1.03ms  17.60ms   75.68%
    Req/Sec    13.19k     2.19k   23.10k    75.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.49ms
 75.000%    2.15ms
 90.000%    2.88ms
 99.000%    4.27ms
 99.900%   11.91ms
 99.990%   15.65ms
 99.999%   16.36ms
100.000%   17.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.036     0.000000            1         1.00
       0.575     0.100000        18773         1.11
       0.839     0.200000        37552         1.25
       1.058     0.300000        56279         1.43
       1.269     0.400000        75070         1.67
       1.493     0.500000        93761         2.00
       1.611     0.550000       103155         2.22
       1.728     0.600000       112562         2.50
       1.854     0.650000       121933         2.86
       1.990     0.700000       131283         3.33
       2.147     0.750000       140635         4.00
       2.235     0.775000       145306         4.44
       2.331     0.800000       149991         5.00
       2.441     0.825000       154742         5.71
       2.565     0.850000       159418         6.67
       2.709     0.875000       164050         8.00
       2.789     0.887500       166406         8.89
       2.879     0.900000       168762        10.00
       2.977     0.912500       171112        11.43
       3.079     0.925000       173432        13.33
       3.193     0.937500       175772        16.00
       3.257     0.943750       176944        17.78
       3.325     0.950000       178140        20.00
       3.407     0.956250       179304        22.86
       3.499     0.962500       180473        26.67
       3.605     0.968750       181636        32.00
       3.661     0.971875       182222        35.56
       3.727     0.975000       182802        40.00
       3.799     0.978125       183385        45.71
       3.889     0.981250       183969        53.33
       3.999     0.984375       184557        64.00
       4.057     0.985938       184849        71.11
       4.123     0.987500       185145        80.00
       4.207     0.989062       185434        91.43
       4.327     0.990625       185729       106.67
       4.483     0.992188       186022       128.00
       4.587     0.992969       186174       142.22
       4.751     0.993750       186320       160.00
       4.947     0.994531       186459       182.86
       5.215     0.995313       186606       213.33
       6.027     0.996094       186753       256.00
       6.419     0.996484       186825       284.44
       6.931     0.996875       186899       320.00
       7.439     0.997266       186972       365.71
       8.199     0.997656       187046       426.67
       9.543     0.998047       187118       512.00
       9.943     0.998242       187155       568.89
      10.767     0.998437       187192       640.00
      11.239     0.998633       187229       731.43
      11.575     0.998828       187265       853.33
      11.975     0.999023       187302      1024.00
      12.159     0.999121       187321      1137.78
      12.279     0.999219       187338      1280.00
      12.447     0.999316       187356      1462.86
      12.631     0.999414       187375      1706.67
      12.847     0.999512       187393      2048.00
      12.991     0.999561       187402      2275.56
      13.095     0.999609       187412      2560.00
      13.191     0.999658       187420      2925.71
      13.567     0.999707       187430      3413.33
      14.143     0.999756       187439      4096.00
      14.431     0.999780       187443      4551.11
      14.663     0.999805       187448      5120.00
      14.799     0.999829       187453      5851.43
      14.895     0.999854       187457      6826.67
      15.087     0.999878       187462      8192.00
      15.383     0.999890       187464      9102.22
      15.695     0.999902       187466     10240.00
      15.815     0.999915       187468     11702.86
      15.911     0.999927       187471     13653.33
      16.007     0.999939       187473     16384.00
      16.015     0.999945       187474     18204.44
      16.039     0.999951       187475     20480.00
      16.047     0.999957       187476     23405.71
      16.087     0.999963       187478     27306.67
      16.143     0.999969       187479     32768.00
      16.143     0.999973       187479     36408.89
      16.255     0.999976       187480     40960.00
      16.255     0.999979       187480     46811.43
      16.279     0.999982       187481     54613.33
      16.359     0.999985       187482     65536.00
      16.359     0.999986       187482     72817.78
      16.359     0.999988       187482     81920.00
      16.359     0.999989       187482     93622.86
      17.135     0.999991       187483    109226.67
      17.135     0.999992       187483    131072.00
      17.135     0.999993       187483    145635.56
      17.135     0.999994       187483    163840.00
      17.135     0.999995       187483    187245.71
      17.615     0.999995       187484    218453.33
      17.615     1.000000       187484          inf
#[Mean    =        1.647, StdDeviation   =        1.030]
#[Max     =       17.600, Total count    =       187484]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  719283 requests in 15.00s, 457.54MB read
Requests/sec:  47945.73
Transfer/sec:     30.50MB