docs/benchmark/results-wrk2-c1000/raw/nginx-R80000-r2.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.300ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.283ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.279ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.286ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  710.74us  17.25ms   77.44%
    Req/Sec    21.08k     2.00k   30.40k    73.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.22ms
 75.000%    1.65ms
 90.000%    2.03ms
 99.000%    3.15ms
 99.900%    8.93ms
 99.990%   12.97ms
 99.999%   17.04ms
100.000%   17.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.039     0.000000            1         1.00
       0.538     0.100000        30025         1.11
       0.730     0.200000        60034         1.25
       0.897     0.300000        90083         1.43
       1.063     0.400000       120027         1.67
       1.222     0.500000       150140         2.00
       1.301     0.550000       164999         2.22
       1.382     0.600000       180061         2.50
       1.467     0.650000       195112         2.86
       1.556     0.700000       210027         3.33
       1.647     0.750000       225090         4.00
       1.695     0.775000       232484         4.44
       1.748     0.800000       240032         5.00
       1.806     0.825000       247510         5.71
       1.872     0.850000       255045         6.67
       1.945     0.875000       262498         8.00
       1.984     0.887500       266217         8.89
       2.029     0.900000       270029        10.00
       2.077     0.912500       273718        11.43
       2.131     0.925000       277527        13.33
       2.193     0.937500       281301        16.00
       2.227     0.943750       283164        17.78
       2.265     0.950000       284974        20.00
       2.311     0.956250       286909        22.86
       2.365     0.962500       288754        26.67
       2.431     0.968750       290611        32.00
       2.475     0.971875       291549        35.56
       2.527     0.975000       292491        40.00
       2.595     0.978125       293416        45.71
       2.677     0.981250       294343        53.33
       2.793     0.984375       295281        64.00
       2.863     0.985938       295739        71.11
       2.961     0.987500       296208        80.00
       3.069     0.989062       296679        91.43
       3.203     0.990625       297145       106.67
       3.363     0.992188       297615       128.00
       3.465     0.992969       297851       142.22
       3.611     0.993750       298081       160.00
       3.793     0.994531       298315       182.86
       4.053     0.995313       298549       213.33
       4.379     0.996094       298785       256.00
       4.599     0.996484       298902       284.44
       4.943     0.996875       299023       320.00
       5.327     0.997266       299138       365.71
       5.843     0.997656       299252       426.67
       6.311     0.998047       299370       512.00
       6.635     0.998242       299429       568.89
       7.043     0.998437       299487       640.00
       7.639     0.998633       299545       731.43
       8.415     0.998828       299604       853.33
       8.991     0.999023       299663      1024.00
       9.175     0.999121       299692      1137.78
       9.415     0.999219       299721      1280.00
       9.735     0.999316       299750      1462.86
       9.943     0.999414       299780      1706.67
      10.431     0.999512       299809      2048.00
      10.679     0.999561       299825      2275.56
      10.999     0.999609       299838      2560.00
      11.631     0.999658       299855      2925.71
      11.863     0.999707       299868      3413.33
      12.023     0.999756       299882      4096.00
      12.239     0.999780       299890      4551.11
      12.375     0.999805       299897      5120.00
      12.471     0.999829       299905      5851.43
      12.583     0.999854       299913      6826.67
      12.711     0.999878       299919      8192.00
      12.919     0.999890       299923      9102.22
      13.023     0.999902       299926     10240.00
      13.151     0.999915       299930     11702.86
      13.367     0.999927       299934     13653.33
      13.967     0.999939       299937     16384.00
      14.911     0.999945       299939     18204.44
      14.999     0.999951       299941     20480.00
      15.007     0.999957       299943     23405.71
      15.343     0.999963       299945     27306.67
      15.959     0.999969       299946     32768.00
      16.287     0.999973       299947     36408.89
      16.399     0.999976       299948     40960.00
      16.431     0.999979       299949     46811.43
      16.511     0.999982       299950     54613.33
      17.023     0.999985       299951     65536.00
      17.023     0.999986       299951     72817.78
      17.039     0.999988       299952     81920.00
      17.039     0.999989       299952     93622.86
      17.103     0.999991       299953    109226.67
      17.103     0.999992       299953    131072.00
      17.103     0.999993       299953    145635.56
      17.167     0.999994       299954    163840.00
      17.167     0.999995       299954    187245.71
      17.167     0.999995       299954    218453.33
      17.167     0.999996       299954    262144.00
      17.167     0.999997       299954    291271.11
      17.263     0.999997       299955    327680.00
      17.263     1.000000       299955          inf
#[Mean    =        1.284, StdDeviation   =        0.711]
#[Max     =       17.248, Total count    =       299955]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1150560 requests in 15.00s, 731.87MB read
Requests/sec:  76703.17
Transfer/sec:     48.79MB